<a href="https://colab.research.google.com/github/Shin-Sangseok/Google_colab_practice/blob/main/colab_test_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [160]:
print('test')

test

In [161]:
import pandas as pd

In [162]:
import numpy as np

In [163]:
df = pd.read_csv(r'C:\Users\hi\colab\scientists.csv')
df

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [164]:
#google drive에서 파일을 읽어오는 경우

In [165]:
#from google.colab import drive
#colab이 설치되어있는 리눅스에 구글 드라이브를 연결해야함 
#연결 == mount(마운트)

In [166]:
#drive.mount('/content/drive')

In [167]:
df2= pd.read_csv(r'C:\Users\hi\colab\scientists.csv')
df2

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [168]:
dates = pd.date_range('20190301', periods=6)
dates

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06'],
              dtype='datetime64[ns]', freq='D')

In [169]:
np.random.randn(6,4)

array([[ 1.46932707, -0.92654893, -2.08425927,  1.82300861],
       [ 0.07193121,  0.25372815, -1.31135632, -0.15206135],
       [ 0.92045879,  1.36379659,  1.35070282,  0.55800929],
       [-1.12028277, -0.69169911,  1.16095787,  0.72092395],
       [ 0.30186257,  0.97158253,  0.87116022,  0.33747336],
       [ 0.45740299,  0.00605798,  1.03970866,  1.08706778]])

In [170]:
df = pd.DataFrame(np.random.randn(6,4), columns=['A','B','C','D'])
#df = df.DataFrame(ndarray(values), columns = ['컬럼명', '컬럼명'...])
df

          A         B         C         D
0 -2.897259 -1.073626 -0.078208 -0.612798
1 -0.180808 -0.041345  1.967930  1.052217
2  0.653966  2.009792  0.590649 -0.945848
3  0.658682 -0.571509 -0.039555  0.225020
4  1.291013  1.117327  0.059455  1.017059
5 -1.834897  2.043658 -0.567503 -1.569837

In [171]:
df2 = pd.DataFrame(np.random.randn(6,4),index = dates, columns=['A','B','C','D'])
df2

                   A         B         C         D
2019-03-01 -0.232375  0.450098 -0.080049  0.358225
2019-03-02  0.473501  2.031230 -0.844802  0.506166
2019-03-03  0.022535  0.509934  0.534216 -1.432281
2019-03-04  0.395268 -0.343806 -0.628395 -0.398094
2019-03-05  1.736742 -0.598615  0.349504  0.582914
2019-03-06 -0.434374 -1.695443  1.149313 -2.068056

In [172]:
type(df2)

pandas.core.frame.DataFrame

In [173]:
df2.index

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06'],
              dtype='datetime64[ns]', freq='D')

In [174]:
in1 = df2.index
in1

DatetimeIndex(['2019-03-01', '2019-03-02', '2019-03-03', '2019-03-04',
               '2019-03-05', '2019-03-06'],
              dtype='datetime64[ns]', freq='D')

In [175]:
in1[0]

Timestamp('2019-03-01 00:00:00', freq='D')

In [176]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [177]:
in2 = df.index
in2

RangeIndex(start=0, stop=6, step=1)

In [178]:
in2[2] 
#리스트를 가지고 만든 여러가지 객체들은 리스트처럼 똑같이 다루어도 크게 문제가 발생하지 않는다.

2

In [179]:
ts1 = in1[0]
ts1

Timestamp('2019-03-01 00:00:00', freq='D')

In [180]:
str(ts1)

'2019-03-01 00:00:00'

In [181]:
df['A']

0   -2.897259
1   -0.180808
2    0.653966
3    0.658682
4    1.291013
5   -1.834897
Name: A, dtype: float64

In [182]:
type(df['A'])

pandas.core.series.Series

In [183]:
a = df['A']
a

0   -2.897259
1   -0.180808
2    0.653966
3    0.658682
4    1.291013
5   -1.834897
Name: A, dtype: float64

In [184]:
a[0]

-2.8972585132096245

In [185]:
a[1]

-0.18080837483520235

In [186]:
df2.values

array([[-0.23237477,  0.45009827, -0.0800487 ,  0.3582249 ],
       [ 0.47350057,  2.03123019, -0.8448024 ,  0.50616598],
       [ 0.02253494,  0.50993361,  0.5342158 , -1.43228107],
       [ 0.39526846, -0.34380606, -0.62839527, -0.39809397],
       [ 1.73674224, -0.5986149 ,  0.3495039 ,  0.58291445],
       [-0.43437396, -1.69544303,  1.14931304, -2.06805647]])

In [187]:
df2.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.326883  0.058900  0.079964 -0.408521
std    0.774440  1.258473  0.749009  1.114428
min   -0.434374 -1.695443 -0.844802 -2.068056
25%   -0.168647 -0.534913 -0.491309 -1.173734
50%    0.208902  0.053146  0.134728 -0.019935
75%    0.453943  0.494975  0.488038  0.469181
max    1.736742  2.031230  1.149313  0.582914

In [188]:
df2.sort_index()

                   A         B         C         D
2019-03-01 -0.232375  0.450098 -0.080049  0.358225
2019-03-02  0.473501  2.031230 -0.844802  0.506166
2019-03-03  0.022535  0.509934  0.534216 -1.432281
2019-03-04  0.395268 -0.343806 -0.628395 -0.398094
2019-03-05  1.736742 -0.598615  0.349504  0.582914
2019-03-06 -0.434374 -1.695443  1.149313 -2.068056

In [189]:
df2.sort_index(ascending=False)

                   A         B         C         D
2019-03-06 -0.434374 -1.695443  1.149313 -2.068056
2019-03-05  1.736742 -0.598615  0.349504  0.582914
2019-03-04  0.395268 -0.343806 -0.628395 -0.398094
2019-03-03  0.022535  0.509934  0.534216 -1.432281
2019-03-02  0.473501  2.031230 -0.844802  0.506166
2019-03-01 -0.232375  0.450098 -0.080049  0.358225

In [190]:
df2.sort_values(by='A')

                   A         B         C         D
2019-03-06 -0.434374 -1.695443  1.149313 -2.068056
2019-03-01 -0.232375  0.450098 -0.080049  0.358225
2019-03-03  0.022535  0.509934  0.534216 -1.432281
2019-03-04  0.395268 -0.343806 -0.628395 -0.398094
2019-03-02  0.473501  2.031230 -0.844802  0.506166
2019-03-05  1.736742 -0.598615  0.349504  0.582914

In [191]:
df2.sort_values(by='A', ascending=False)

                   A         B         C         D
2019-03-05  1.736742 -0.598615  0.349504  0.582914
2019-03-02  0.473501  2.031230 -0.844802  0.506166
2019-03-04  0.395268 -0.343806 -0.628395 -0.398094
2019-03-03  0.022535  0.509934  0.534216 -1.432281
2019-03-01 -0.232375  0.450098 -0.080049  0.358225
2019-03-06 -0.434374 -1.695443  1.149313 -2.068056

In [192]:
df3 = df2.copy()
df3

                   A         B         C         D
2019-03-01 -0.232375  0.450098 -0.080049  0.358225
2019-03-02  0.473501  2.031230 -0.844802  0.506166
2019-03-03  0.022535  0.509934  0.534216 -1.432281
2019-03-04  0.395268 -0.343806 -0.628395 -0.398094
2019-03-05  1.736742 -0.598615  0.349504  0.582914
2019-03-06 -0.434374 -1.695443  1.149313 -2.068056

In [193]:
# df3를 B로 정렬해주세요 
# df3의 내용이 변경되어야 합니다.
df3 = df3.sort_values(by='B')
df3

                   A         B         C         D
2019-03-06 -0.434374 -1.695443  1.149313 -2.068056
2019-03-05  1.736742 -0.598615  0.349504  0.582914
2019-03-04  0.395268 -0.343806 -0.628395 -0.398094
2019-03-01 -0.232375  0.450098 -0.080049  0.358225
2019-03-03  0.022535  0.509934  0.534216 -1.432281
2019-03-02  0.473501  2.031230 -0.844802  0.506166

In [194]:
#변경된 df3에서 b, c만 추출 
df3bc=df3[['B','C']] #밖의 대괄호는 추출의 의미 안의 대괄호는 묶어주는 의미 
df3bc

                   B         C
2019-03-06 -1.695443  1.149313
2019-03-05 -0.598615  0.349504
2019-03-04 -0.343806 -0.628395
2019-03-01  0.450098 -0.080049
2019-03-03  0.509934  0.534216
2019-03-02  2.031230 -0.844802

In [195]:
#df3의 첫번째 행 첫번째 열의 값을 1로 수정
df3.iloc[0,0]=1 
df3.iloc[0,0]

1.0

In [196]:
#df3에서 0행에서 2행까지 추출 
df3.iloc[0:3] #df.iloc[추출범위]=>행으로 취급! 
#df3.iloc[0:3,:] 이렇게 생략 된 것. 
#df3.iloc[:,0:2] #df3.iloc[추출범위 행, 추출범위 열]=>열로 추출 가능! 
#열은 하나만 쓸 수 없다.

                   A         B         C         D
2019-03-06  1.000000 -1.695443  1.149313 -2.068056
2019-03-05  1.736742 -0.598615  0.349504  0.582914
2019-03-04  0.395268 -0.343806 -0.628395 -0.398094

In [197]:
#df3에서 2019-03-01, A열의 값을 추출 
type(df3.loc['2019-03-01','A'])

pandas.core.series.Series

In [198]:
#df3에서 2019-03-01, A열 ,B열의 값을 추출 
df3.loc['2019-03-01',['A','B']]

                   A         B
2019-03-01 -0.232375  0.450098

In [199]:
#df3에서 A열의 전체 행을 추출 
df3.loc[:,'A']

2019-03-06    1.000000
2019-03-05    1.736742
2019-03-04    0.395268
2019-03-01   -0.232375
2019-03-03    0.022535
2019-03-02    0.473501
Name: A, dtype: float64

In [200]:
#df3에서 A,C열의 전체 행을 추출
df3.loc[:,['A','C']]
#loc, iloc의 결과가 1행 인경우 ,Series로 리턴 
#loc, iloc의 결과가 여러 행이면, DataFrame으로 리턴

                   A         C
2019-03-06  1.000000  1.149313
2019-03-05  1.736742  0.349504
2019-03-04  0.395268 -0.628395
2019-03-01 -0.232375 -0.080049
2019-03-03  0.022535  0.534216
2019-03-02  0.473501 -0.844802

In [201]:
#A열을 추출하여 2번째 값을 추출 
print(type(df3.loc[:,'A']))
df3.loc[:,'A']
#df3.loc[:,'A'].to_list() 

#d53에서 2019-03-01, A열의 값을 추출하여 1번째 값 추출 

#결과가 1행인 경우, Series(list처럼 다루면 된다)

#A열과 C열을 추출하여 1번째행 1번째 열의 값 추출 
#결과가 2행 이상인 경우, DataFrame임 (df로 다루면 된다 )

c = df3.loc[:,['A','C']]
c.iloc[1,1]

<class 'pandas.core.series.Series'>

0.3495039017468092

In [202]:
#df3에서 0번 행렬 추출 
df3.iloc[0,:]

A    1.000000
B   -1.695443
C    1.149313
D   -2.068056
Name: 2019-03-06 00:00:00, dtype: float64

In [203]:
type(df3.iloc[0,:])

pandas.core.series.Series

In [204]:
#df3의 행렬의 크기를 추출 
df3.shape

(6, 4)

In [205]:
df3.T

   2019-03-06  2019-03-05  2019-03-04  2019-03-01  2019-03-03  2019-03-02
A    1.000000    1.736742    0.395268   -0.232375    0.022535    0.473501
B   -1.695443   -0.598615   -0.343806    0.450098    0.509934    2.031230
C    1.149313    0.349504   -0.628395   -0.080049    0.534216   -0.844802
D   -2.068056    0.582914   -0.398094    0.358225   -1.432281    0.506166

In [206]:
#df3에서 5행 전체 열 추출 
df3.iloc[5]

A    0.473501
B    2.031230
C   -0.844802
D    0.506166
Name: 2019-03-02 00:00:00, dtype: float64

In [207]:
#df3에서 4행부터 추출 
print(df3)
df3.iloc[4:]

                   A         B         C         D
2019-03-06  1.000000 -1.695443  1.149313 -2.068056
2019-03-05  1.736742 -0.598615  0.349504  0.582914
2019-03-04  0.395268 -0.343806 -0.628395 -0.398094
2019-03-01 -0.232375  0.450098 -0.080049  0.358225
2019-03-03  0.022535  0.509934  0.534216 -1.432281
2019-03-02  0.473501  2.031230 -0.844802  0.506166

                   A         B         C         D
2019-03-03  0.022535  0.509934  0.534216 -1.432281
2019-03-02  0.473501  2.031230 -0.844802  0.506166

In [208]:
#df3에서 0,3행, 1부터 2열까지 추출 
df3.iloc[[0,3],[1,2]]

                   B         C
2019-03-06 -1.695443  1.149313
2019-03-01  0.450098 -0.080049

In [209]:
#df3에서 1,2,5행, 1,3열 추출 
df3.iloc[[1,2,5],[1,3]]

                   B         D
2019-03-05 -0.598615  0.582914
2019-03-04 -0.343806 -0.398094
2019-03-02  2.031230  0.506166

In [210]:
#df는 기본적으로 행, 열의 위치값을 가지고 있음 
#기본적으로 가지고 있는 위치값을 이용해서 조작하는 경우 
#iloc[]를 사용 
#일부 그래프나 분석시 특정항목을 index항목으로 수동으로 설정해야 하는 경우가 있음 
#특정항목을 index항목으로 설정가능한 경우는 
#"unique/not null한 값을 가지는 항목"만 
#설정 가능 user_id, bbs_id  pk 조건과 일치 
df4 = df2.copy()
df4

                   A         B         C         D
2019-03-01 -0.232375  0.450098 -0.080049  0.358225
2019-03-02  0.473501  2.031230 -0.844802  0.506166
2019-03-03  0.022535  0.509934  0.534216 -1.432281
2019-03-04  0.395268 -0.343806 -0.628395 -0.398094
2019-03-05  1.736742 -0.598615  0.349504  0.582914
2019-03-06 -0.434374 -1.695443  1.149313 -2.068056

In [211]:
df4.reset_index(inplace=True)

In [212]:
df4.set_index('index', inplace=True)

In [213]:
df4

                   A         B         C         D
index
2019-03-01 -0.232375  0.450098 -0.080049  0.358225
2019-03-02  0.473501  2.031230 -0.844802  0.506166
2019-03-03  0.022535  0.509934  0.534216 -1.432281
2019-03-04  0.395268 -0.343806 -0.628395 -0.398094
2019-03-05  1.736742 -0.598615  0.349504  0.582914
2019-03-06 -0.434374 -1.695443  1.149313 -2.068056

In [214]:
df4['E']= df4['A']+1 #브로드 캐스팅

In [215]:
df4.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [216]:
df4['E']

index
2019-03-01    0.767625
2019-03-02    1.473501
2019-03-03    1.022535
2019-03-04    1.395268
2019-03-05    2.736742
2019-03-06    0.565626
Name: E, dtype: float64

In [217]:
df4['F'] = 0

In [218]:
df4['F']

index
2019-03-01    0
2019-03-02    0
2019-03-03    0
2019-03-04    0
2019-03-05    0
2019-03-06    0
Name: F, dtype: int64

In [219]:
df4['G'] = range(0,6)
df4['G']

index
2019-03-01    0
2019-03-02    1
2019-03-03    2
2019-03-04    3
2019-03-05    4
2019-03-06    5
Name: G, dtype: int32

In [220]:
df4.reset_index(inplace=True) #reset_index는 일반 컬럼으로 가버림. 
#f4.set_index('G',inplace=True)

In [221]:
#인덱스를 변경하고 싶은 경우, 기존의 인덱스를 살리고 싶으면 
#먼저 reset_index()하고 나서 해야함. 
#reset을 안하는 경우 기존 index는 사라진다. 
df4.set_index('G',inplace=True)

In [223]:
df4

       index         A         B         C         D         E  F
G
0 2019-03-01 -0.232375  0.450098 -0.080049  0.358225  0.767625  0
1 2019-03-02  0.473501  2.031230 -0.844802  0.506166  1.473501  0
2 2019-03-03  0.022535  0.509934  0.534216 -1.432281  1.022535  0
3 2019-03-04  0.395268 -0.343806 -0.628395 -0.398094  1.395268  0
4 2019-03-05  1.736742 -0.598615  0.349504  0.582914  2.736742  0
5 2019-03-06 -0.434374 -1.695443  1.149313 -2.068056  0.565626  0

In [224]:
df4.columns #G는 인덱스로 잡혀 있어서 눈에 안보이는 것.

Index(['index', 'A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [226]:
df3 = df.copy()
df3

          A         B         C         D
0 -2.897259 -1.073626 -0.078208 -0.612798
1 -0.180808 -0.041345  1.967930  1.052217
2  0.653966  2.009792  0.590649 -0.945848
3  0.658682 -0.571509 -0.039555  0.225020
4  1.291013  1.117327  0.059455  1.017059
5 -1.834897  2.043658 -0.567503 -1.569837

In [231]:
import random

In [232]:
#E항목을 파생 변수로 만드세요. 1~10 범위 값 
#F항목을 파생 변수로 만드세요. A열과 C열의 합 
#h항목을 파생변수로 만드세요. 1로 설정
#Z항목을 파생변수로 만드세요. 1~9까지 랜덤한 값

In [233]:
df3['E'] = random.randint(1,10)
df3['E']

0    4
1    4
2    4
3    4
4    4
5    4
Name: E, dtype: int64

In [235]:
df3['F'] = df3['A']+ df3['C']
df3

          A         B         C         D  E         F
0 -2.897259 -1.073626 -0.078208 -0.612798  4 -2.975466
1 -0.180808 -0.041345  1.967930  1.052217  4  1.787121
2  0.653966  2.009792  0.590649 -0.945848  4  1.244614
3  0.658682 -0.571509 -0.039555  0.225020  4  0.619127
4  1.291013  1.117327  0.059455  1.017059  4  1.350467
5 -1.834897  2.043658 -0.567503 -1.569837  4 -2.402399

In [236]:
df3['H'] = 1

In [238]:
df3['Z'] = [random.randin(1,10) for _ in range(6)]

AttributeError: module 'random' has no attribute 'randin'